AXLAPI.xml

<?xml version="1.0" encoding="UTF-8"?>
<definitions
        xmlns="http://schemas.xmlsoap.org/wsdl/"
        xmlns:http="http://schemas.xmlsoap.org/wsdl/http/"
        xmlns:mime="http://schemas.xmlsoap.org/wsdl/mime/"
        xmlns:s="http://www.w3.org/2001/XMLSchema"
        xmlns:s0="http://www.cisco.com/AXLAPIService/"
        xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
        xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
        xmlns:tm="http://microsoft.com/wsdl/mime/textMatching/"
        xmlns:xsd1="http://www.cisco.com/AXL/API/11.5"
        targetNamespace="http://www.cisco.com/AXLAPIService/">

    <import location="AXLSoap.xsd" namespace="http://www.cisco.com/AXL/API/11.5"/>
    <binding name="AXLAPIBinding" type="s0:AXLPort">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="listPhone">
            <soap:operation soapAction="CUCM:DB ver=11.5 listPhone" style="document"/>
            <input>
                <soap:body use="literal"/>
            </input>
            <output>
                <soap:body use="literal"/>
            </output>
            <fault name="fault">
                <soap:fault name="fault" use="literal"/>
            </fault>
        </operation>

    </binding>

    <service name="AXLAPIService">
    <port binding="s0:AXLAPIBinding" name="AXLPort">
        <soap:address location="https://ucmd1.davidson.edu:8443/axl/"/>
    </port>
    </service>
</definitions>
